In [1]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

In [4]:
ser1 = Series(np.arange(3), index=['A','B','C'])

ser1 = 2*ser1

ser1

A    0
B    2
C    4
dtype: int32

In [5]:
ser1['B']

2

In [6]:
ser1[1]

2

In [7]:
ser1[0:3]

A    0
B    2
C    4
dtype: int32

In [8]:
ser1[['A','B']]

A    0
B    2
dtype: int32

In [9]:
ser1[ser1>3]

C    4
dtype: int32

In [11]:
ser1[ser1>3] = 10

ser1

A     0
B     2
C    10
dtype: int32

In [13]:
dframe = DataFrame(np.arange(25).reshape((5,5)), index = ['NYC','LA','SF','DC','Chi'],
                  columns=['A','B','C','D','E'])

dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [14]:
dframe[['B','E']]

      B   E
NYC   1   4
LA    6   9
SF   11  14
DC   16  19
Chi  21  24

In [15]:
dframe[dframe['C']>8]

      A   B   C   D   E
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [16]:
dframe > 10

         A      B      C      D      E
NYC  False  False  False  False  False
LA   False  False  False  False  False
SF   False   True   True   True   True
DC    True   True   True   True   True
Chi   True   True   True   True   True

In [18]:
dframe.loc['LA']

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int32

In [22]:
dframe.iloc[1]

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int32

In [23]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [25]:
ser1 = Series([0,1,2], index=['A','B','C'])
ser1

A    0
B    1
C    2
dtype: int64

In [27]:
ser2 = Series([3,4,5,6],index = ['A','B','C','D'])
ser2

A    3
B    4
C    5
D    6
dtype: int64

In [28]:
ser1 + ser2

A    3.0
B    5.0
C    7.0
D    NaN
dtype: float64

In [29]:
dframe1 = DataFrame(np.arange(4).reshape((2,2)), columns = list('AB'),index=['NYC','LA'])
dframe1

     A  B
NYC  0  1
LA   2  3

In [30]:
dframe2 = DataFrame(np.arange(9).reshape((3,3)), columns=list('ADC'),index = ['NYC','SF','LA'])
dframe2

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [32]:
dframe1 + dframe2

       A   B   C   D
LA   8.0 NaN NaN NaN
NYC  0.0 NaN NaN NaN
SF   NaN NaN NaN NaN

In [33]:
dframe1

     A  B
NYC  0  1
LA   2  3

In [34]:
dframe1.add(dframe2,fill_value=0)

       A    B    C    D
LA   8.0  3.0  8.0  7.0
NYC  0.0  1.0  2.0  1.0
SF   3.0  NaN  5.0  4.0

In [35]:
dframe2

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [36]:
ser3 = dframe2.iloc[0]

In [37]:
ser3

A    0
D    1
C    2
Name: NYC, dtype: int32

In [38]:
dframe2-ser3

     A  D  C
NYC  0  0  0
SF   3  3  3
LA   6  6  6

In [1]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd

In [3]:
ser1 = Series(range(3), index=['C','A','B'])

ser1

C    0
A    1
B    2
dtype: int64